# åŠ¨æ‰‹å­¦æ•°æ®åˆ†æ

## 1 ç¬¬ä¸€ç« ç¬¬ä¸€èŠ‚ï¼šæ•°æ®è½½å…¥åŠåˆæ­¥è§‚å¯Ÿ

### 1.1 è½½å…¥æ•°æ®
æ•°æ®é›†ä¸‹è½½ https://www.kaggle.com/c/titanic/overview  

éœ€è¦æ³¨å†Œkaggle

#### 1.1.1 ä»»åŠ¡ä¸€ï¼šå¯¼å…¥numpyå’Œpandas

In [2]:
import numpy as np
import pandas as pd

#### 1.1.2 ä»»åŠ¡äºŒï¼šè½½å…¥æ•°æ®
(1) ä½¿ç”¨ç›¸å¯¹è·¯å¾„è½½å…¥æ•°æ®  
(2) ä½¿ç”¨ç»å¯¹è·¯å¾„è½½å…¥æ•°æ®

In [3]:
df = pd.read_csv('train.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [8]:
df = pd.read_csv('C:/Users/Administrator/Desktop/hands-on-data-analysis-master/hands-on-data-analysis-master/ç¬¬ä¸€å•å…ƒé¡¹ç›®é›†åˆ/train.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
#æŸ¥çœ‹å½“å‰å·¥ä½œç›®å½•
import os 
os.getcwd()

'C:\\Users\\Administrator\\Desktop\\hands-on-data-analysis-master\\hands-on-data-analysis-master\\ç¬¬ä¸€å•å…ƒé¡¹ç›®é›†åˆ'

tableã€csvåˆ†éš”ç¬¦ä¸åŒ tableè¯»å–txtï¼Œåˆ†éš”ç¬¦æ˜¯\t   csvçš„åˆ†éš”ç¬¦ä¸ºé€—å·
ä¸åŒæ•°æ®ç±»å‹ï¼ŒåŠ è½½å’Œæ€è·¯éƒ½å·®ä¸å¤šï¼Œå¤šç™¾åº¦ï¼Œå¤šæŸ¥æ‰¾

#### 1.1.3 ä»»åŠ¡ä¸‰ï¼šæ¯1000è¡Œä¸ºä¸€ä¸ªæ•°æ®æ¨¡å—ï¼Œé€å—è¯»å–

In [15]:
chunker = pd.read_csv('train.csv', chunksize=1000)

è¯»å–æ–‡ä»¶æ˜¯å¤§æ–‡ä»¶ï¼Œè€Œæœ‰æ—¶å€™æˆ‘ä»¬åªæƒ³è¦è¯»å–å…¶ä¸­çš„ä¸€éƒ¨åˆ†æ•°æ®æˆ–å¯¹æ–‡ä»¶è¿›è¡Œé€å—å¤„ç†ã€‚

#### 1.1.4 ä»»åŠ¡å››ï¼šå°†è¡¨å¤´æ”¹æˆä¸­æ–‡ï¼Œç´¢å¼•æ”¹ä¸ºä¹˜å®¢ID [å¯¹äºæŸäº›è‹±æ–‡èµ„æ–™ï¼Œæˆ‘ä»¬å¯ä»¥é€šè¿‡ç¿»è¯‘æ¥æ›´ç›´è§‚çš„ç†Ÿæ‚‰æˆ‘ä»¬çš„æ•°æ®]
PassengerId => ä¹˜å®¢ID  
Survived    => æ˜¯å¦å¹¸å­˜   
Pclass      => ä¹˜å®¢ç­‰çº§(1/2/3ç­‰èˆ±ä½)  
Name        => ä¹˜å®¢å§“å  
Sex         => æ€§åˆ«                 
Age         => å¹´é¾„                 
SibSp       => å ‚å…„å¼Ÿ/å¦¹ä¸ªæ•°  
Parch       => çˆ¶æ¯ä¸å°å­©ä¸ªæ•°  
Ticket      => èˆ¹ç¥¨ä¿¡æ¯             
Fare        => ç¥¨ä»·                
Cabin       => å®¢èˆ±                
Embarked    => ç™»èˆ¹æ¸¯å£

In [16]:
df = pd.read_csv('train.csv', names=['ä¹˜å®¢ID','æ˜¯å¦å¹¸å­˜','ä»“ä½ç­‰çº§','å§“å','æ€§åˆ«','å¹´é¾„','å…„å¼Ÿå§å¦¹ä¸ªæ•°','çˆ¶æ¯å­å¥³ä¸ªæ•°','èˆ¹ç¥¨ä¿¡æ¯','ç¥¨ä»·','å®¢èˆ±','ç™»èˆ¹æ¸¯å£'],index_col='ä¹˜å®¢ID',header=0)
df.head()
## nameså½¢å¼æ˜¯æ•°ç»„ï¼Œå¦‚æœcsvå†…åŒ…å«åˆ—åç§°ï¼Œç”¨header=0 æ¥æ˜¾ç¤ºä¼ é€’

,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
ä¹˜å®¢ID,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

ã€æ€è€ƒã€‘æ‰€è°“å°†è¡¨å¤´æ”¹ä¸ºä¸­æ–‡å…¶ä¸­ä¸€ä¸ªæ€è·¯æ˜¯ï¼šå°†è‹±æ–‡é¢åº¦è¡¨å¤´æ›¿æ¢æˆä¸­æ–‡ã€‚è¿˜æœ‰å…¶ä»–çš„æ–¹æ³•å—ï¼Ÿ
ç›´æ¥å®šä¹‰åˆ—åç§° df.columns=[]

### 1.2 åˆæ­¥è§‚å¯Ÿ
å¯¼å…¥æ•°æ®åï¼Œä½ å¯èƒ½è¦å¯¹æ•°æ®çš„æ•´ä½“ç»“æ„å’Œæ ·ä¾‹è¿›è¡Œæ¦‚è§ˆï¼Œæ¯”å¦‚è¯´ï¼Œæ•°æ®å¤§å°ã€æœ‰å¤šå°‘åˆ—ï¼Œå„åˆ—éƒ½æ˜¯ä»€ä¹ˆæ ¼å¼çš„ï¼Œæ˜¯å¦åŒ…å«nullç­‰

#### 1.2.1 ä»»åŠ¡ä¸€ï¼šæŸ¥çœ‹æ•°æ®çš„åŸºæœ¬ä¿¡æ¯

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   æ˜¯å¦å¹¸å­˜    891 non-null    int64
 1   ä»“ä½ç­‰çº§    891 non-null    int64
 2   å§“å      891 non-null    object
 3   æ€§åˆ«      891 non-null    object
 4   å¹´é¾„      714 non-null    float64
 5   å…„å¼Ÿå§å¦¹ä¸ªæ•°  891 non-null    int64
 6   çˆ¶æ¯å­å¥³ä¸ªæ•°  891 non-null    int64
 7   èˆ¹ç¥¨ä¿¡æ¯    891 non-null    object
 8   ç¥¨ä»·      891 non-null    float64
 9   å®¢èˆ±      204 non-null    object
 10  ç™»èˆ¹æ¸¯å£    889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

#### 1.2.2 ä»»åŠ¡äºŒï¼šè§‚å¯Ÿè¡¨æ ¼å‰10è¡Œçš„æ•°æ®å’Œå15è¡Œçš„æ•°æ®

In [21]:
df.head(10)

,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
ä¹˜å®¢ID,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [22]:
df.tail(15)

,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
ä¹˜å®¢ID,,,,,,,,,,,
877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### 1.2.4 ä»»åŠ¡ä¸‰ï¼šåˆ¤æ–­æ•°æ®æ˜¯å¦ä¸ºç©ºï¼Œä¸ºç©ºçš„åœ°æ–¹è¿”å›Trueï¼Œå…¶ä½™åœ°æ–¹è¿”å›False

In [23]:
df.isnull().head()

,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
ä¹˜å®¢ID,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,True,False

ã€æ€è€ƒã€‘å¯¹äºä¸€ä¸ªæ•°æ®ï¼Œè¿˜å¯ä»¥ä»å“ªäº›æ–¹é¢æ¥è§‚å¯Ÿï¼Ÿæ‰¾æ‰¾ç­”æ¡ˆï¼Œè¿™ä¸ªå°†å¯¹ä¸‹é¢çš„æ•°æ®åˆ†ææœ‰å¾ˆå¤§çš„å¸®åŠ©
**ç›¸å…³æ€§**

### 1.3 ä¿å­˜æ•°æ®

#### 1.3.1 ä»»åŠ¡ä¸€ï¼šå°†ä½ åŠ è½½å¹¶åšå‡ºæ”¹å˜çš„æ•°æ®ï¼Œåœ¨å·¥ä½œç›®å½•ä¸‹ä¿å­˜ä¸ºä¸€ä¸ªæ–°æ–‡ä»¶train_chinese.csv

In [25]:
df.to_csv('train_chinese.csv')
#å¹¶æ²¡æœ‰ä¹±ç ï¼Œå¯ä»¥æ·»åŠ encodingã€encoding=â€˜utf_8_sigâ€™

## 1 ç¬¬ä¸€ç« ç¬¬äºŒèŠ‚ï¼špandasåŸºç¡€

### 1.4 çŸ¥é“ä½ çš„æ•°æ®å«ä»€ä¹ˆ
æˆ‘ä»¬å­¦ä¹ pandasçš„åŸºç¡€æ“ä½œï¼Œé‚£ä¹ˆä¸Šä¸€èŠ‚é€šè¿‡pandasåŠ è½½ä¹‹åçš„æ•°æ®ï¼Œå…¶æ•°æ®ç±»å‹æ˜¯ä»€ä¹ˆå‘¢ï¼Ÿ
**dateframe**

#### 1.4.1 ä»»åŠ¡ä¸€ï¼špandasä¸­æœ‰ä¸¤ä¸ªæ•°æ®ç±»å‹DateFrameå’ŒSeriesï¼Œé€šè¿‡æŸ¥æ‰¾ç®€å•äº†è§£ä»–ä»¬ã€‚ç„¶åè‡ªå·±å†™ä¸€ä¸ªå…³äºè¿™ä¸¤ä¸ªæ•°æ®ç±»å‹çš„å°ä¾‹å­ğŸŒ°[å¼€æ”¾é¢˜]

In [26]:
import numpy as np
import pandas as pd

In [27]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
example_1 = pd.Series(sdata)
example_1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
example_2 = pd.DataFrame(data)
example_2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

#### 1.4.2 ä»»åŠ¡äºŒï¼šæ ¹æ®ä¸ŠèŠ‚è¯¾çš„æ–¹æ³•è½½å…¥"train.csv"æ–‡ä»¶

In [29]:
df = pd.read_csv('C:/Users/Administrator/Desktop/hands-on-data-analysis-master/hands-on-data-analysis-master/ç¬¬ä¸€å•å…ƒé¡¹ç›®é›†åˆ/train.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 1.4.3 ä»»åŠ¡ä¸‰ï¼šæŸ¥çœ‹DataFrameæ•°æ®çš„æ¯åˆ—çš„é¡¹

In [30]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4ä»»åŠ¡å››ï¼šæŸ¥çœ‹"cabin"è¿™åˆ—çš„æ‰€æœ‰é¡¹ [æœ‰å¤šç§æ–¹æ³•]

In [31]:
df['Cabin'].head(3)

0    NaN
1    C85
2    NaN
Name: Cabin, dtype: object

In [32]:
df.Cabin.head(3)

0    NaN
1    C85
2    NaN
Name: Cabin, dtype: object

#### 1.4.5 ä»»åŠ¡äº”ï¼šåŠ è½½æ–‡ä»¶"test_1.csv"ï¼Œç„¶åå¯¹æ¯”"train.csv"ï¼Œçœ‹çœ‹æœ‰å“ªäº›å¤šå‡ºçš„åˆ—ï¼Œç„¶åå°†å¤šå‡ºçš„åˆ—åˆ é™¤
ç»è¿‡æˆ‘ä»¬çš„è§‚å¯Ÿå‘ç°ä¸€ä¸ªæµ‹è¯•é›†test_1.csvæœ‰ä¸€åˆ—æ˜¯å¤šä½™çš„ï¼Œæˆ‘ä»¬éœ€è¦å°†è¿™ä¸ªå¤šä½™çš„åˆ—åˆ å»

In [39]:
test_1 = pd.read_csv('test_1.csv')
test_1.head(3)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100

In [34]:
# åˆ é™¤å¤šä½™çš„åˆ—
del test_1['a']
test_1.head(3)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

ã€æ€è€ƒã€‘è¿˜æœ‰å…¶ä»–çš„åˆ é™¤å¤šä½™çš„åˆ—çš„æ–¹å¼å—ï¼Ÿ

In [40]:
test_1.drop(['a'],axis=1).head(3)
# axis=1 æŒ‰åˆ—åˆ é™¤

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 1.4.6 ä»»åŠ¡å…­ï¼š å°†['PassengerId','Name','Age','Ticket']è¿™å‡ ä¸ªåˆ—å…ƒç´ éšè—ï¼Œåªè§‚å¯Ÿå…¶ä»–å‡ ä¸ªåˆ—å…ƒç´

In [41]:
df.drop(['PassengerId','Name','Age','Ticket'],axis=1).head(3)

   Survived  Pclass     Sex  SibSp  Parch     Fare Cabin Embarked
0         0       3    male      1      0   7.2500   NaN        S
1         1       1  female      1      0  71.2833   C85        C
2         1       3  female      0      0   7.9250   NaN        S

ã€æ€è€ƒã€‘å¯¹æ¯”ä»»åŠ¡äº”å’Œä»»åŠ¡å…­ï¼Œæ˜¯ä¸æ˜¯ä½¿ç”¨äº†ä¸ä¸€æ ·çš„æ–¹æ³•(å‡½æ•°)ï¼Œå¦‚æœä½¿ç”¨ä¸€æ ·çš„å‡½æ•°å¦‚ä½•å®Œæˆä¸Šé¢çš„ä¸åŒçš„è¦æ±‚å‘¢ï¼Ÿ

å¯ä»¥åœ¨å†…å®¹é‡Œä¼ é€’ 
```inplace=True```
å‚æ•°è¿›å»,å°±æŠŠåŸå‚æ•°è¦†ç›–äº†

### 1.5 ç­›é€‰çš„é€»è¾‘

è¡¨æ ¼æ•°æ®ä¸­ï¼Œæœ€é‡è¦çš„ä¸€ä¸ªåŠŸèƒ½å°±æ˜¯è¦å…·æœ‰å¯ç­›é€‰çš„èƒ½åŠ›ï¼Œé€‰å‡ºæˆ‘æ‰€éœ€è¦çš„ä¿¡æ¯ï¼Œä¸¢å¼ƒæ— ç”¨çš„ä¿¡æ¯ã€‚

ä¸‹é¢æˆ‘ä»¬è¿˜æ˜¯ç”¨å®æˆ˜æ¥å­¦ä¹ pandasè¿™ä¸ªåŠŸèƒ½ã€‚

#### 1.5.1 ä»»åŠ¡ä¸€ï¼š æˆ‘ä»¬ä»¥"Age"ä¸ºç­›é€‰æ¡ä»¶ï¼Œæ˜¾ç¤ºå¹´é¾„åœ¨10å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯ã€‚

In [42]:
df[df["Age"]<10].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q

#### 1.5.2 ä»»åŠ¡äºŒï¼š ä»¥"Age"ä¸ºæ¡ä»¶ï¼Œå°†å¹´é¾„åœ¨10å²ä»¥ä¸Šå’Œ50å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯æ˜¾ç¤ºå‡ºæ¥ï¼Œå¹¶å°†è¿™ä¸ªæ•°æ®å‘½åä¸ºmidage

In [43]:
midage = df[(df["Age"]>10)& (df["Age"]<50)]
midage.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

ã€æç¤ºã€‘äº†è§£pandasçš„æ¡ä»¶ç­›é€‰æ–¹å¼ä»¥åŠå¦‚ä½•ä½¿ç”¨äº¤é›†å’Œå¹¶é›†æ“ä½œ

#### 1.5.3 ä»»åŠ¡ä¸‰ï¼šå°†midageçš„æ•°æ®ä¸­ç¬¬100è¡Œçš„"Pclass"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [44]:
midage = midage.reset_index(drop=True)
midage.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

ã€æ€è€ƒã€‘è¿™ä¸ªreset_index()å‡½æ•°çš„ä½œç”¨æ˜¯ä»€ä¹ˆï¼Ÿå¦‚æœä¸ç”¨è¿™ä¸ªå‡½æ•°ï¼Œä¸‹é¢çš„ä»»åŠ¡ä¼šå‡ºç°ä»€ä¹ˆæƒ…å†µï¼Ÿ

In [45]:
midage.loc[[100],['Pclass','Sex']]

     Pclass   Sex
100       2  male

#### 1.5.4 ä»»åŠ¡å››ï¼šä½¿ç”¨locæ–¹æ³•å°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [46]:
midage.loc[[100,105,108],['Pclass','Name','Sex']] #å› ä¸ºä½ ä¸»åŠ¨çš„å»¶é•¿äº†è¡Œçš„è·ç¦»ï¼Œæ‰€ä»¥ä¼šäº§ç”Ÿè¡¨æ ¼å½¢å¼

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

ã€æç¤ºã€‘ä½¿ç”¨pandasæå‡ºçš„ç®€å•æ–¹å¼ï¼Œä½ å¯ä»¥çœ‹çœ‹locæ–¹æ³•

å¯¹æ¯”æ•´ä½“çš„æ•°æ®ä½ç½®ï¼Œä½ æœ‰å‘ç°ä»€ä¹ˆé—®é¢˜å—ï¼Ÿé‚£ä¹ˆå¦‚ä½•è§£å†³ï¼Ÿ

#### 1.5.5 ä»»åŠ¡äº”ï¼šä½¿ç”¨ilocæ–¹æ³•å°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [47]:
midage.iloc[[100,105,108],[2,3,4]]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

# 1 ç¬¬ä¸€ç« ç¬¬ä¸‰èŠ‚ï¼šæ¢ç´¢æ€§æ•°æ®åˆ†æ

#### å¼€å§‹ä¹‹å‰ï¼Œå¯¼å…¥numpyã€pandasåŒ…å’Œæ•°æ®

In [48]:
#åŠ è½½æ‰€éœ€çš„åº“
import numpy as np
import pandas as pd

In [49]:
#è½½å…¥ä¹‹å‰ä¿å­˜çš„train_chinese.csvæ•°æ®ï¼Œå…³äºæ³°å¦å°¼å…‹å·çš„ä»»åŠ¡ï¼Œæˆ‘ä»¬å°±ä½¿ç”¨è¿™ä¸ªæ•°æ®
text = pd.read_csv('train_chinese.csv')
text.head()

,ä¹˜å®¢ID,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1.6 äº†è§£ä½ çš„æ•°æ®å—ï¼Ÿ
æ•™æã€ŠPython for Data Analysisã€‹ç¬¬äº”ç«

#### 1.6.1 ä»»åŠ¡ä¸€ï¼šåˆ©ç”¨Pandaså¯¹ç¤ºä¾‹æ•°æ®è¿›è¡Œæ’åºï¼Œè¦æ±‚å‡åº

In [50]:
# å…·ä½“è¯·çœ‹ã€Šåˆ©ç”¨Pythonè¿›è¡Œæ•°æ®åˆ†æã€‹ç¬¬äº”ç«  æ’åºå’Œæ’å éƒ¨åˆ†

#è‡ªå·±æ„å»ºä¸€ä¸ªéƒ½ä¸ºæ•°å­—çš„DataFrameæ•°æ®
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), 
                     index=['2', '1'], 
                     columns=['d', 'a', 'b', 'c'])
frame

   d  a  b  c
2  0  1  2  3
1  4  5  6  7

ã€ä»£ç è§£æã€‘

pd.DataFrame() ï¼šåˆ›å»ºä¸€ä¸ªDataFrameå¯¹è±¡ 

np.arange(8).reshape((2, 4)) : ç”Ÿæˆä¸€ä¸ªäºŒç»´æ•°ç»„ï¼ˆ2*4ï¼‰,ç¬¬ä¸€åˆ—ï¼š0ï¼Œ1ï¼Œ2ï¼Œ3 ç¬¬äºŒåˆ—ï¼š4ï¼Œ5ï¼Œ6ï¼Œ7

index=['2, 1] ï¼šDataFrame å¯¹è±¡çš„ç´¢å¼•åˆ—

columns=['d', 'a', 'b', 'c'] ï¼šDataFrame å¯¹è±¡çš„ç´¢å¼•è¡Œ

In [51]:
# å¤§å¤šæ•°æ—¶å€™æˆ‘ä»¬éƒ½æ˜¯æƒ³æ ¹æ®åˆ—çš„å€¼æ¥æ’åº,æ‰€ä»¥ï¼Œå°†ä½ æ„å»ºçš„DataFrameä¸­çš„æ•°æ®æ ¹æ®æŸä¸€åˆ—ï¼Œå‡åºæ’åˆ—
frame.sort_values(by='c', ascending=False)

   d  a  b  c
1  4  5  6  7
2  0  1  2  3

å¯ä»¥çœ‹åˆ°sort_valuesè¿™ä¸ªå‡½æ•°ä¸­byå‚æ•°æŒ‡å‘è¦æ’åˆ—çš„åˆ—ï¼Œascendingå‚æ•°æŒ‡å‘æ’åºçš„æ–¹å¼ï¼ˆå‡åºè¿˜æ˜¯é™åºï¼‰

ã€æ€»ç»“ã€‘ä¸‹é¢å°†ä¸åŒçš„æ’åºæ–¹å¼åšä¸€ä¸ªå°æ€»ç»“

In [52]:
# è®©è¡Œç´¢å¼•å‡åºæ’åº
frame.sort_index()

   d  a  b  c
1  4  5  6  7
2  0  1  2  3

In [53]:
# è®©åˆ—ç´¢å¼•å‡åºæ’åº
frame.sort_index(axis=1)

   a  b  c  d
2  1  2  3  0
1  5  6  7  4

In [54]:
# è®©åˆ—ç´¢å¼•é™åºæ’åº
frame.sort_index(axis=1, ascending=False)

   d  c  b  a
2  0  3  2  1
1  4  7  6  5

In [55]:
# è®©ä»»é€‰ä¸¤åˆ—æ•°æ®åŒæ—¶é™åºæ’åº
frame.sort_values(by=['a', 'c'])

   d  a  b  c
2  0  1  2  3
1  4  5  6  7

#### 1.6.2 ä»»åŠ¡äºŒï¼šå¯¹æ³°å¦å°¼å…‹å·æ•°æ®ï¼ˆtrian.csvï¼‰æŒ‰ç¥¨ä»·å’Œå¹´é¾„ä¸¤åˆ—è¿›è¡Œç»¼åˆæ’åºï¼ˆé™åºæ’åˆ—ï¼‰ï¼Œä»æ•°æ®ä¸­ä½ èƒ½å‘ç°ä»€ä¹ˆ

In [56]:
'''
åœ¨å¼€å§‹æˆ‘ä»¬å·²ç»å¯¼å…¥äº†train_chinese.csvæ•°æ®ï¼Œè€Œä¸”å‰é¢æˆ‘ä»¬ä¹Ÿå­¦ä¹ äº†å¯¼å…¥æ•°æ®è¿‡ç¨‹ï¼Œæ ¹æ®ä¸Šé¢å­¦ä¹ ï¼Œæˆ‘ä»¬ç›´æ¥å¯¹ç›®æ ‡åˆ—è¿›è¡Œæ’åºå³å¯
head(20) : è¯»å–å‰20æ¡æ•°æ®
'''

text.sort_values(by=['ç¥¨ä»·', 'å¹´é¾„'], ascending=False).head(3)

,ä¹˜å®¢ID,æ˜¯å¦å¹¸å­˜,ä»“ä½ç­‰çº§,å§“å,æ€§åˆ«,å¹´é¾„,å…„å¼Ÿå§å¦¹ä¸ªæ•°,çˆ¶æ¯å­å¥³ä¸ªæ•°,èˆ¹ç¥¨ä¿¡æ¯,ç¥¨ä»·,å®¢èˆ±,ç™»èˆ¹æ¸¯å£
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

ã€æ€è€ƒã€‘æ’åºåï¼Œå¦‚æœæˆ‘ä»¬ä»…ä»…å…³æ³¨å¹´é¾„å’Œç¥¨ä»·ä¸¤åˆ—ã€‚æ ¹æ®å¸¸è¯†æˆ‘çŸ¥é“å‘ç°ç¥¨ä»·è¶Šé«˜çš„åº”è¯¥å®¢èˆ±è¶Šå¥½ï¼Œæ‰€ä»¥æˆ‘ä»¬ä¼šæ˜æ˜¾çœ‹å‡ºï¼Œç¥¨ä»·å‰20çš„ä¹˜å®¢ä¸­å­˜æ´»çš„æœ‰14äººï¼Œè¿™æ˜¯ç›¸å½“é«˜çš„ä¸€ä¸ªæ¯”ä¾‹ï¼Œé‚£ä¹ˆæˆ‘ä»¬åé¢æ˜¯ä¸æ˜¯å¯ä»¥è¿›ä¸€æ­¥åˆ†æä¸€ä¸‹ç¥¨ä»·å’Œå­˜æ´»ä¹‹é—´çš„å…³ç³»ï¼Œå¹´é¾„å’Œå­˜æ´»ä¹‹é—´çš„å…³ç³»å‘¢ï¼Ÿå½“ä½ å¼€å§‹å‘ç°æ•°æ®ä¹‹é—´çš„å…³ç³»äº†ï¼Œæ•°æ®åˆ†æå°±å¼€å§‹äº†ã€‚

å½“ç„¶ï¼Œè¿™åªæ˜¯æˆ‘çš„æƒ³æ³•ï¼Œä½ è¿˜å¯ä»¥æœ‰æ›´å¤šæƒ³æ³•ï¼Œæ¬¢è¿å†™åœ¨ä½ çš„å­¦ä¹ ç¬”è®°ä¸­ã€‚

#### 1.6.3 ä»»åŠ¡ä¸‰ï¼šåˆ©ç”¨Pandasè¿›è¡Œç®—æœ¯è®¡ç®—ï¼Œè®¡ç®—ä¸¤ä¸ªDataFrameæ•°æ®ç›¸åŠ ç»“æœ

In [57]:
# å…·ä½“è¯·çœ‹ã€Šåˆ©ç”¨Pythonè¿›è¡Œæ•°æ®åˆ†æã€‹ç¬¬äº”ç«  ç®—æœ¯è¿ç®—ä¸æ•°æ®å¯¹é½ éƒ¨åˆ†

#å»ºç«‹ä¸€ä¸ªä¾‹å­
frame1_a = pd.DataFrame(np.arange(9.).reshape(3, 3),
                     columns=['a', 'b', 'c'],
                     index=['one', 'two', 'three'])
frame1_b = pd.DataFrame(np.arange(12.).reshape(4, 3),
                     columns=['a', 'e', 'c'],
                     index=['first', 'one', 'two', 'second'])
frame1_a

         a    b    c
one    0.0  1.0  2.0
two    3.0  4.0  5.0
three  6.0  7.0  8.0

In [58]:
frame1_b

          a     e     c
first   0.0   1.0   2.0
one     3.0   4.0   5.0
two     6.0   7.0   8.0
second  9.0  10.0  11.0

In [59]:
#å°†frame_aå’Œframe_bè¿›è¡Œç›¸åŠ 
frame1_a + frame1_b

          a   b     c   e
first   NaN NaN   NaN NaN
one     3.0 NaN   7.0 NaN
second  NaN NaN   NaN NaN
three   NaN NaN   NaN NaN
two     9.0 NaN  13.0 NaN

ã€æé†’ã€‘ä¸¤ä¸ªDataFrameç›¸åŠ åï¼Œä¼šè¿”å›ä¸€ä¸ªæ–°çš„DataFrameï¼Œå¯¹åº”çš„è¡Œå’Œåˆ—çš„å€¼ä¼šç›¸åŠ ï¼Œæ²¡æœ‰å¯¹åº”çš„ä¼šå˜æˆç©ºå€¼NaNã€‚<br>
å½“ç„¶ï¼ŒDataFrameè¿˜æœ‰å¾ˆå¤šç®—æœ¯è¿ç®—ï¼Œå¦‚å‡æ³•ï¼Œé™¤æ³•ç­‰ï¼Œæœ‰å…´è¶£çš„åŒå­¦å¯ä»¥çœ‹ã€Šåˆ©ç”¨Pythonè¿›è¡Œæ•°æ®åˆ†æã€‹ç¬¬äº”ç«  ç®—æœ¯è¿ç®—ä¸æ•°æ®å¯¹é½ éƒ¨åˆ†ï¼Œå¤šåœ¨ç½‘ç»œä¸ŠæŸ¥æ‰¾ç›¸å…³å­¦ä¹ èµ„æ–™ã€‚

#### 1.6.4 ä»»åŠ¡å››ï¼šé€šè¿‡æ³°å¦å°¼å…‹å·æ•°æ®å¦‚ä½•è®¡ç®—å‡ºåœ¨èˆ¹ä¸Šæœ€å¤§çš„å®¶æ—æœ‰å¤šå°‘äººï¼Ÿ

In [61]:
'''
è¿˜æ˜¯ç”¨ä¹‹å‰å¯¼å…¥çš„chinese_train.csvå¦‚æœæˆ‘ä»¬æƒ³çœ‹çœ‹åœ¨èˆ¹ä¸Šï¼Œæœ€å¤§çš„å®¶æ—æœ‰å¤šå°‘äººï¼ˆâ€˜å…„å¼Ÿå§å¦¹ä¸ªæ•°â€™+â€˜çˆ¶æ¯å­å¥³ä¸ªæ•°â€™ï¼‰ï¼Œæˆ‘ä»¬è¯¥æ€ä¹ˆåšå‘¢ï¼Ÿ
'''
max(text['å…„å¼Ÿå§å¦¹ä¸ªæ•°'] + text['çˆ¶æ¯å­å¥³ä¸ªæ•°'])

10

æ˜¯çš„ï¼Œå¦‚ä¸Šï¼Œå¾ˆç®€å•ï¼Œæˆ‘ä»¬åªéœ€æ‰¾å‡ºå…„å¼Ÿå§å¦¹ä¸ªæ•°å’Œçˆ¶æ¯å­å¥³ä¸ªæ•°ä¹‹å’Œæœ€å¤§çš„æ•°å°±è¡Œï¼Œå…ˆè®©è¿™ä¸¤åˆ—ç›¸åŠ è¿”å›ä¸€ä¸ªDataFrameï¼Œç„¶åç”¨maxå‡½æ•°æ±‚å‡ºæœ€å¤§å€¼ï¼Œå½“ç„¶ä½ è¿˜å¯ä»¥æƒ³å‡ºå¾ˆå¤šæ–¹æ³•å’Œæ€è€ƒè§’åº¦ï¼Œæ¬¢è¿ä½ æ¥è¯´å‡ºä½ çš„çœ‹æ³•ã€‚

#### 1.6.5 ä»»åŠ¡äº”ï¼šå­¦ä¼šä½¿ç”¨Pandas describe()å‡½æ•°æŸ¥çœ‹æ•°æ®åŸºæœ¬ç»Ÿè®¡ä¿¡æ¯

In [66]:
#(1) å…³é”®çŸ¥è¯†ç‚¹ç¤ºä¾‹åšä¸€éï¼ˆç®€å•æ•°æ®ï¼‰
# å…·ä½“è¯·çœ‹ã€Šåˆ©ç”¨Pythonè¿›è¡Œæ•°æ®åˆ†æã€‹ç¬¬äº”ç«  æ±‡æ€»å’Œè®¡ç®—æè¿°ç»Ÿè®¡ éƒ¨åˆ†

#å»ºç«‹ä¸€ä¸ªä¾‹å­
frame2 = pd.DataFrame([[1.4, np.nan], 
                       [7.1, -4.5],
                       [np.nan, np.nan], 
                       [0.75, -1.3]
                      ], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
frame2

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [71]:
# è°ƒç”¨ describe å‡½æ•°ï¼Œè§‚å¯Ÿframe2çš„æ•°æ®åŸºæœ¬ä¿¡æ¯

frame2.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

#### 1.6.6 ä»»åŠ¡å…­ï¼šåˆ†åˆ«çœ‹çœ‹æ³°å¦å°¼å…‹å·æ•°æ®é›†ä¸­ ç¥¨ä»·ã€çˆ¶æ¯å­å¥³ è¿™åˆ—æ•°æ®çš„åŸºæœ¬ç»Ÿè®¡æ•°æ®ï¼Œä½ èƒ½å‘ç°ä»€ä¹ˆï¼Ÿ

In [72]:
'''
çœ‹çœ‹æ³°å¦å°¼å…‹å·æ•°æ®é›†ä¸­ ç¥¨ä»· è¿™åˆ—æ•°æ®çš„åŸºæœ¬ç»Ÿè®¡æ•°æ®
'''
text['ç¥¨ä»·'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: ç¥¨ä»·, dtype: float64

ã€æ€è€ƒã€‘ä»ä¸Šé¢æ•°æ®æˆ‘ä»¬å¯ä»¥çœ‹å‡ºï¼Œ
ä¸€å…±æœ‰891ä¸ªç¥¨ä»·æ•°æ®ï¼Œ
å¹³å‡å€¼çº¦ä¸ºï¼š32.20ï¼Œ
æ ‡å‡†å·®çº¦ä¸º49.69ï¼Œè¯´æ˜ç¥¨ä»·æ³¢åŠ¨ç‰¹åˆ«å¤§ï¼Œ
25%çš„äººçš„ç¥¨ä»·æ˜¯ä½äº7.91çš„ï¼Œ50%çš„äººçš„ç¥¨ä»·ä½äº14.45ï¼Œ75%çš„äººçš„ç¥¨ä»·ä½äº31.00ï¼Œ
ç¥¨ä»·æœ€å¤§å€¼çº¦ä¸º512.33ï¼Œæœ€å°å€¼ä¸º0ã€‚
<br>å½“ç„¶ï¼Œè¿™åªæ˜¯æˆ‘çš„æƒ³æ³•ï¼Œä½ è¿˜å¯ä»¥æœ‰æ›´å¤šæƒ³æ³•ï¼Œæ¬¢è¿å†™åœ¨ä½ çš„å­¦ä¹ ç¬”è®°ä¸­ã€‚

In [73]:
'''
é€šè¿‡ä¸Šé¢çš„ä¾‹å­ï¼Œæˆ‘ä»¬å†çœ‹çœ‹æ³°å¦å°¼å…‹å·æ•°æ®é›†ä¸­ çˆ¶æ¯å­å¥³ä¸ªæ•° è¿™åˆ—æ•°æ®çš„åŸºæœ¬ç»Ÿè®¡æ•°æ®ï¼Œç„¶åå¯ä»¥è¯´å‡ºä½ çš„æƒ³æ³•
'''
text['çˆ¶æ¯å­å¥³ä¸ªæ•°'].describe()

count    891.000000
mean       0.381594
std        0.806057
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        6.000000
Name: çˆ¶æ¯å­å¥³ä¸ªæ•°, dtype: float64

In [ ]:
ã€æ€è€ƒã€‘æœ‰æ›´å¤šæƒ³æ³•ï¼Œæ¬¢è¿å†™åœ¨ä½ çš„å­¦ä¹ ç¬”è®°ä¸­ã€‚

ã€æ€»ç»“ã€‘æœ¬èŠ‚ä¸­æˆ‘ä»¬é€šè¿‡Pandasçš„ä¸€äº›å†…ç½®å‡½æ•°å¯¹æ•°æ®è¿›è¡Œäº†åˆæ­¥ç»Ÿè®¡æŸ¥çœ‹ï¼Œè¿™ä¸ªè¿‡ç¨‹æœ€é‡è¦çš„ä¸æ˜¯å¤§å®¶å¾—æŒæ¡è¿™äº›å‡½æ•°ï¼Œè€Œæ˜¯çœ‹æ‡‚ä»è¿™äº›å‡½æ•°å‡ºæ¥çš„æ•°æ®ï¼Œæ„å»ºè‡ªå·±çš„æ•°æ®åˆ†ææ€ç»´ï¼Œè¿™ä¹Ÿæ˜¯ç¬¬ä¸€ç« æœ€é‡è¦çš„ç‚¹ï¼Œå¸Œæœ›å¤§å®¶å­¦å®Œç¬¬ä¸€ç« èƒ½å¯¹æ•°æ®æœ‰ä¸ªåŸºæœ¬è®¤è¯†ï¼Œäº†è§£è‡ªå·±åœ¨åšä»€ä¹ˆï¼Œä¸ºä»€ä¹ˆè¿™ä¹ˆåšï¼Œåé¢çš„ç« èŠ‚æˆ‘ä»¬å°†å¼€å§‹å¯¹æ•°æ®è¿›è¡Œæ¸…æ´—ï¼Œè¿›ä¸€æ­¥åˆ†æã€‚